[
	{
		"pk":1,
		"model":"roster.Coach",
		"fields": {
			"firstname": "Mike",
                        "lastname": "Fox",
                        "title": "Head Coach",
			"story": "Entering his 16th season as head coach at the University of North Carolina, Mike Fox has guided his alma mater to the most successful period in school history and firmly established the Tar Heels as one of the nation's preeminent college baseball programs. Capped by six trips to the College World Series in the last eight years, Carolina has made 14 appearances in the NCAA Tournament and posted a 694-274-1 record in Fox's 15 seasons in Chapel Hill. Fox, who ranks first among the game's active leaders in career winning percentage, has been recognized by several outlets as one of the nation's top coaches in recent years. Baseball America honored Fox as its national coach of the year in 2008, and Fox's peers - the American Baseball Coaches Association - selected him as the Atlantic Region Coach of the Year in three of the last four seasons. Fox's leadership and vision were instrumental in the construction of the $25.6-million Boshamer Stadium, which opened in 2009 to rave reviews as one of the finest collegiate baseball facilities in the nation. The stadium underwent another updgrade this offseason with the installation of a state of the art video board. One of only six men to play in and then coach his alma mater to the College World Series, Fox has led Carolina to 12 consecutive trips to postseason play for the first time in school history. Fox has coached his teams to NCAA tourney play in 28 of his 30 seasons as a head coach, including a combined 14 trips to the NCAA Division I and Division III World Series. Fox, who has led Carolina to 15 College World Series victories over the last eight seasons, has either played or coached in all 17 CWS wins by the Tar Heels. But just as important as the on-field success Fox has found at UNC is the type of program that he has built. On Feb. 28, 2007, while the Tar Heels were ranked No. 1 by Baseball America, they also claimed the top spot when USA Today re-ranked its preseason top 25 based on the NCAA's Academic Progress Rate (APR). Fox's players are regulars on the Atlantic Coast Conference's Academic Honor Roll, including 36 honorees over the last seven seasons, and he has coached five ESPN The Magazine Academic all-district selections in the last eight years, including Adam Warren, who was an Academic All-America pick in 2009, and Benton Moss in 2013. Fox became the 24th head coach in Carolina history on May 7, 1998, when former Athletic Director Dick Baddour selected the former UNC player and North Carolina Wesleyan College head coach to lead the Tar Heels into the 21st century. Fox is just the third head coach in Chapel Hill since 1947. Fox has set a high standard of success in his first 156 years on the job, averaging more than 46 wins per season and guiding the Tar Heels to 50 or more victories in five of the last eight seasons, including a school-record 59 in 2013. Fox collected his 700th career college coaching victory in 2002, his 800th career win in 2005 and his 900th win in 2007. He reached the 1,000-win mark with a 10-3 victory over Gardner-Webb March 4, 2009 and notched his 1,100th win in 2011. Win No. 1,200 came in a 10-0 win over UNCW on April 3, 2013. Overall, 68 Tar Heels to play for Fox over the past 15 years have been drafted by Major League Baseball organizations, including 11 first-round or supplemental selections: Colin Moran in 2013, Levi Michael in 2011, Matt Harvey in 2010, Dustin Ackley and Alex White in 2009, Andrew Miller and Daniel Bard in 2006, Russ Adams in 2002, Tyrell Godwin in 2000 and Mike Bynum and Kyle Snyder in 1999. Thirty-two of Fox's former Tar Heels were on professional rosters in 2013. Rob Wooten became the latest Fox product to debut in MLB this past summer as he made his first appearance for the Milwaukee Brewers on July 26. In the past three years Carolina has had nine former players debut in the big leagues, more than any school in the country. Fox has coached 29 first-team All-ACC selections, including Kent Emanuel, Colin Moran and Cody Stubbs last season. Tar Heels have earned 25 different All-America honors under Fox, including Emanuel, Moran and Cody Stubbs in 2013. Moran became the fourth Tar Heel under Fox's tutelage to be named ACC Freshman of the Year as he joined Adam Greenberg (2000), Daniel Bard (2004) and Dustin Ackley (2007). Moran also joined Ackley as Baseball America's Freshman of the Year in 2011 before earning ACC Player of the Year honors as a junior. The Tar Heels advanced to the NCAA Championship for the 12th consecutive year under Fox in 2013 as the team earned the No. 1 overall seed for the first time in school history. With dramatic wins over Florida Atlantic in the regional round and over South Carolina in the supers, Carolina advanced to its sixth CWS in eight years and posted a third-place finish with wins over LSU and NC State. The trip to Omaha capped an incredible season that saw UNC sit atop the national polls for much of the year as Carolina won a school-record 59 games. The 2011 season saw the Tar Heels become the 13th school in NCAA history to appear in five College World Series in a six-year span. That squad racked up 51 wins on the back of first round draft pick Levi Michael and ACC Freshman of the Year Moran. Carolina became the first school in ACC history to make four straight trips to the College World Series in 2009. The Tar Heels featured Dustin Ackley, who would finish as UNC's career leader in average, hits, runs and total bases. Ackley was the Tar Heels' top individual performer in 2009, as he posted an ACC-best .417 average and 22 home runs, while also adding 111 hits, 75 runs and 73 RBI. He was named Rivals.com National Player of the Year and became the first three-time All-America in school history. Paced by the first All-America quartet in school history (Alex White, Kyle Seager, Dustin Ackley and Tim Fedroff), the Tar Heels went 54-14 and reached the College World Series for the third straight season in 2008, placing third. Despite not playing on campus with Boshamer Stadium under construction, Carolina hosted both NCAA regionals and super regionals in Cary and went 5-0 en route to yet another trip to Omaha. Following a series win at then-No. 1 Miami, the Tar Heels earned the first consensus No. 1 ranking in school history May 19. Chad Flack completed his career as Carolina's career leader in hits, games, at-bats and total bases in 2008. After breaking through with a CWS runner-up finish in 2006, the Tar Heels matched that feat in 2007 despite losing a pair of first-round selections on the mound in Miller and Bard. Carolina won a school record and NCAA-best 57 games and brought home its second straight ACC Coastal Division title and first ACC tournament title since 1990 in the process. In Omaha, Carolina dropped its second game before winning three straight to reach the finals for the second straight season. In 2006, the Tar Heels captured the ACC's Coastal Division title and reached the College World Series for the first time since 1989. Carolina won a then-school record 54 games, including a record 38 at home, and hosted its first NCAA Regional at Boshamer Stadium since 1983. The Tar Heels won their second regional under Fox and then captured the Tuscaloosa Super Regional in dramatic fashion to punch their fifth ticket to Omaha. There, Carolina won its first four games before falling to Oregon State in the championship series, two games to one. Miller won Baseball America National Player of the Year honors and the Roger Clemens Award as the nation's top pitcher, and he joined Horton as an All-America selection. Senior Jonathan Hovis led the nation in ERA at 1.17, while Flack set Carolina's single-season hit record with 112. From 2002-05, the Tar Heels won 40-plus games in each season and reached the NCAA Tournament every year. The 2003 squad was at its best in the postseason, sweeping through the NCAA Starkville Regional with a 3-0 record, including a pair of wins over host Mississippi State. The regional victory was the first for Carolina since the 1989 team reached the College World Series. Carolina also earned top-10 national rankings in 2005 and in 2004 with a team that was led by All-Americas Marshall Hubbard and Chris Iannetta. Hubbard drove in a school-record 83 runs, while Iannetta, who made his major league debut with the Colorado Rockies in 2006, was one of three finalists for the Johnny Bench Award, presented annually to nation's top collegiate catcher. In a record-setting 2000 season, Carolina posted a 46-17 mark, the second-most victories in a season in school history. Carolina earned the No. 2 seed at the NCAA Regional at Upper Montclair, N.J., and came just one win away from advancing to the NCAA Super Regional. In his first year on the job, Fox led Carolina to a school-best 16 straight wins to open the 1999 season and, in the midst of going 22-2 to start the year, the Tar Heels peaked at No. 3 the Baseball America rankings. Carolina went on to earn the No. 3 seed in the NCAA Tournament Palo Alto Regional. Fox came to Carolina after 15 seasons as the head coach at N.C. Wesleyan College in Rocky Mount, where he led the Battling Bishops to 14 NCAA Tournament appearances, eight Division III College World Series appearances and the 1989 NCAA Division III national championship. His teams posted 15 consecutive top-20 finishes in the national polls and won 11 Dixie Conference championships. Fox's career record of 539-141-4 at N.C. Wesleyan ranked second in career winning percentage (.791) among all active Division III head coaches at the time of his return to Carolina. Fox was a three-year letterwinner at Carolina as a second baseman from 1976-78, helping lead the Tar Heels to the 1978 College World Series. As a senior, he hit .277, tied for the team lead with six home runs and was named to the College World Series all-tournament team. Fox also played on the Tar Heel junior varsity basketball team under Eddie Fogler in the 1975 and `76 seasons. The native of Asheville, N.C., is a 1978 graduate of Carolina with a degree in physical education. He earned his Master of Arts in teaching at UNC in 1979. Fox served as a graduate assistant at Carolina during the 1979 season and was the head coach at Millbrook High School in Raleigh in 1980 and '81 before taking over as N.C. Wesleyan's head coach in September of 1982. He also had served as the Battling Bishops' athletic director since 1985. Fox was named the American Baseball Coaches Association Division III National Coach of the Year in 1989 after leading the Battling Bishops to the national title. He has been named the NCAA South Region Coach of the Year and the Dixie Conference Coach of the Year seven times each. He coached 29 All-Americas at N.C. Wesleyan and 92 percent of his players graduated. The 1974 graduate of East Mecklenburg High School in Charlotte, N.C., played independent professional baseball for a year after graduating from Carolina before returning to his alma mater as a graduate assistant in 1979. Fox and his wife, Cheryl, have a son, Matthew (27), and a daughter, Morgan (24).",
            "coaching_age": "16"
            }
	},
        
        {        
                "pk":2,
		"model":"roster.Coach",
		"fields": {
			"firstname": "Scott",
                        "lastname": "Forbes",
                        "title": "Associate Head Coach / Pitching Coach",
			"story": "Collegiate Baseball newspaper's 2008 National College Pitching of the Year, Scott Forbes is in his ninth season mentoring North Carolina's pitching staff and his fifth as the Tar Heels' associate head coach. Forbes, who has totaled a record of 726-287 in 16 seasons as an assistant coach, has been an instrumental part of the Tar Heels' run to the College World Series in six of the last eight seasons. Under his guidance, the Carolina pitching staff has ranked among nation's top 35 in earned run average in each of the last eight seasons, including the fourth-lowest ERA in the nation in 2012. Baseball America recognized Forbes as one of the top assistant coaches in the country prior to the 2013 campaign. On the recruiting front, Forbes played in an integral role in landing some of the nation's top talent as every class brought in to Carolina during his time has been ranked among the top 10 in the country. Forbes, who is in his second stint in Chapel Hill, was an assistant at UNC from 1999-2002 and served as an assistant at Winthrop University for three seasons before returning to Carolina prior to the 2006 season. Forbes has watched over the top three strikeout pitchers in UNC history as Andrew Miller, Alex White and Patrick Johnson are the only hurlers to eclipse 300 strikeouts in a career. The Tar Heels had a pair of All-America pitchers in 2012 as starter Kent Emanuel and closer Michael Morin each earned the honor. Emanuel repeated as an All-America performer in 2013 and was named ACC Pitcher of the Year, while Trent Thornton was a first-team freshman All-America hurler. In Chapel Hill, 23 of Forbes' pitchers have either been drafted or signed professional contracts over the last seven seasons, including first-round picks Daniel Bard (2006), Andrew Miller (2006), Alex White (2009) and Matt Harvey (2010). Forbes and the rest of the UNC staff have gained a reputation of putting the health and future of their pitchers first and foremost, and Miller said it best during the 2006 College World Series: 'I appreciate the coaches basically taking care of me. I've seen a lot of pitchers get abused in the postseason. They have my best interests at heart.' Miller blossomed under Forbes and was named Baseball America's National Player of the Year, the Roger Clemens Award winner, first-team All-America and the Atlantic Coast Conference Pitcher of the Year, while setting UNC records for single-season and career strikeouts in 2006. The No. 6 overall pick by the Detroit Tigers, Miller made his major league debut Aug. 30, 2006, and is currently with the Boston Red Sox with fellow first round pick Daniel Bard. Bard had an outstanding rookie season with the Boston Red Sox in 2009 and has made more than 200 appearances during his time in the big leagues. White was the No. 15 overall selection by the Cleveland Indians in 2010 and made his MLB debut in 2011 before getting traded to the Colorado Rockies. Harvey was drafted in the third round coming out of high school and developed his craft even more at Carolina en route to becoming the No. 7 overall pick in the 2010 draft. Harvey made his MLB debut in 2012 a memorable one with nine strikeouts, the most in a debut by a Met in franchise history. Harvey became a national face of baseball in 2013 as he started the All-Star Game for the National League and appeared on the cover of Sports Illustrated. After working with Forbes and dropping his arm slot prior to the 2007 season, Milwaukee Brewers prospect Rob Wooten emerged as one of the nation's top relievers with 91 appearances over his final two seasons. Wooten earned an invitation to big league camp with the Brewers prior to the 2013 season and made his MLB debut this summer. White anchored the Tar Heels' staff for the second straight season in 2009 and earned first-team All-ACC honors for the second straight season. He was joined on the all-conference team by Brian Moran and Adam Warren, who finished his career second in school history with 32 victories. Additionally, Moran became the fourth pitcher to earn All-America honors under Forbes, joining Carignan, Miller and White. Emanuel (third round), Hobbs Johnson (14th round) and Chris Munnelly (free agent) are the latest Forbes products to make the leap to professional baseball. In 2008, White was also named ACC Pitcher of the Year and - along with Wooten - claimed All-ACC honors. Additionally, freshmen right-handers Harvey and Colin Bates earned freshman All-America honors in 2008. In 2007, right-hander Robert Woodard completed his decorated career as the Tar Heels' career leader in wins and is the only pitcher to rank in the UNC's top 10 in wins, winning percentage, innings and strikeouts. In Miller, Woodard and Warren, Forbes has coached the Tar Heels' career leaders in strikeouts, wins and winning percentage, respectively. Additionally, Forbes has mentored a pair of relievers to NCAA-best performances, as Jonathan Hovis led the nation with a 1.17 ERA in 2006, and Carignan shared the NCAA lead with 18 saves in 2007. In his final season at Winthrop, Forbes helped guide the Eagles to one of the finest seasons in program history in 2005, as they won the Big South title, earned the No. 2 seed in the NCAA Knoxville Regional and posted a 44-22 record. He helped coach five All-Americas and five Major League Baseball draft picks while at Winthrop. Forbes, who was promoted to assistant head coach prior to the 2005 season, served as the Eagles' recruiting coordinator and third base coach. He also worked as the position coach for catchers, outfielders and first basemen and coordinated the Eagles' strength and conditioning program, academic advising, community service and team travel. Forbes joined the Winthrop staff in July 2002. Prior to his stint with the Eagles, Forbes was on Fox's staff at Carolina for four seasons, helping the Tar Heels to NCAA Regional appearances in 1999, 2000 and 2002. While in Chapel Hill, he assisted long-time pitching coach Roger Williams with instruction for the Tar Heels' hurlers and served as position coach for Carolina's catchers and corner infielders. Forbes also assisted with recruiting and served as director of Carolina's summer camps. While at UNC, Forbes spent two summers as head coach and pitching coach of the Coastal Plain League's Wilmington Sharks. In 1999, he guided his team to the CPL title and earned the league's Coach of the Year award and tallied a 59-34 overall record in two summers with the team. After a standout playing career for Fox at North Carolina Wesleyan, Forbes broke into coaching as an assistant with the Battling Bishops during the 1998 season. He served as the team's pitching instructor and called pitches, helping Wesleyan to a 42-9 record and a sixth-place finish at the NCAA Division III College World Series. Forbes also worked as the team's strength coordinator and first base coach. As a player, Forbes hit .321 at Wesleyan from 1995-97 and led the team to a pair of Dixie Conference titles and a fifth-place finish at the 1997 Division III CWS. As a senior, he hit .387 with 61 RBI and 27 doubles, which set the NCAA Division III single-season record. That season, he earned second-team all-region honors and was named most valuable player of the Dixie Conference Tournament, as well as Wesleyan's MVP. Forbes also earned a spot on the regional all-tournament squad. He spent the 1994 season at Middle Georgia College, where he helped the team to the Georgia junior college state title. Forbes earned a Bachelor of Science degree in business administration from North Carolina Wesleyan in May 1998. He is married to the former Mandy Passwaters, and the couple has two daughters, Hannah and Ally.",
            "coaching_age": "9"
            }
	},
        
        {        
                "pk":3,
		"model":"roster.Coach",
		"fields": {
			"firstname": "Scott",
                        "lastname": "Jackson",
                        "title": "Associate Coach / Recruiting Coordinator",
			"story": "Scott Jackson is entering his sixth year as an assistant baseball coach and the recruiting coordinator at the University of North Carolina in 2014. Jackson, who joined the Tar Heels in July 2008 after one season at Liberty, works with the offense, including hitting and base running, as well as infield play. The Tar Heels have a record of 242-84 during Jackson's time in Chapel Hill and have turned in five consecutive NCAA tournament appearances, including three College World Series showings in 2009, 2011 and 2013. Baseball America recognized Jackson as one of the top assistant coaches in the country prior to the 2013 campaign. Despite the change in NCAA bat regulation in 2011 the Tar Heels turned in one of the top scoring seasons in school history. Carolina finished 10th in the nation in runs scored by putting up 452 for the season. A big reason for Carolina's run scoring was its ability to draw walks and get on base as the Tar Heels' 358 walks ranked second in the country. The Tar Heels were a patient group once again in 2012 as they finished with the fourth-most walks in the country.The 2013 squad led the nation in three offensive categores - hits (759), runs (542) and walks (369). Jackson's work with the Carolina infield came to fruition in 2011 as the Tar Heels finished fifth in the country and set a new school record with a .979 fielding percentage. Not a single player on the squad committed more than nine errors in 67 games. Jackson was a big part of Minnesota Twin minor leaguer Levi Michael's development. Michael was a freshman All-America as a second baseman before making the move to third base in 2010 and to shortstop for the 2011 campaign. Michael's versatility appealed to the Twins who selected the infielder 30th overall in the 2011 MLB Draft. Another player to blossom under Jackson's watch has been third baseman Colin Moran. Moran came to Carolina as an unheralded recruit but has developed into one of the top hitters in the country as he earned All-America honors and was named the Baseball America Freshman of the Year in 2011. In his first season in Chapel Hill, Jackson helped guide the Tar Heels to their fourth consecutive College World Series appearance, a .313 team batting average and a .970 fielding percentage. As a junior, Moran was a finalist for the Golden Spikes Award, led the nation with 91 RBIs and was the No. 6 overall pick of the Miami Marlins in the 2013 MLB Draft. Jackson helped coach three-time All-America Dustin Ackley to Atlantic Coast Conference Player of the Year honors and also mentored all-conference selection Kyle Seager. Both Ackley and Seager were selected in the top three rounds of the 2009 Major League Baseball First-Year Player Draft. Jackson's efforts on the recruiting trail have also paid off for the Tar Heels pulling in five straight top-10 classes. The 2010 group of newcomers ranked No. 7 nationally, the 2011 class was ranked No. 6, the 2012 crop was ranked No. 4, the 2013 edition was ranked No. 5 in the country and the incoming class of 2014 was ranked No. 1. Prior to joining the staff at UNC, Jackson served as pitching coach at Liberty and UNC Wilmington but has worked with hitters in coaching stops at Campbell, Barton and Wofford. He also served as head coach of the Wilmington Sharks of the Coastal Plain League in 2002 and earned the league's Coach of the Year Award. In 2008 at Liberty, Jackson helped guide the Flames to a 35-26-1 record and a runner-up finish in the Big South Tournament to Cary Super Regional participant Coastal Carolina. Two of his pitchers were chosen in the 2008 Major League Baseball First-Year Player Draft, and his staff recorded a school record 508 strikeouts. Jackson helped guide UNC Wilmington to one of the most successful periods in school history from 2003-07. He was an integral part of a staff that posted three straight 40-win seasons, won Colonial Athletic Association titles in 2004 and 2006 and reached the NCAA Tournament in 2003, 2004 and 2006. Under Jackson's tutelage, six Seahawk pitchers were selected in the MLB Draft after going undrafted out of high school. His pitching staff established a number of school records at Wilmington, including strikeouts and saves. Jackson also had coaching stints at Campbell (2002), Barton (2001) and Wofford (2000). In addition to his collegiate work, Jackson also spent two seasons with the Wilmington Sharks, where he was an assistant to fellow North Carolina assistant Scott Forbes in 2000. He led the Sharks to a league-best 31-17 mark in 2002 as head coach and coached five MLB draft picks. Jackson is a 1998 graduate of Campbell with a bachelor's degree in physical education and he earned a master's degree in education in 2000, also from Campbell. During his playing days with the Camels, he played seven different positions and posted a career .268 batting average in 182 games. A Charlotte native, Jackson is married to the former Sara Moore, who was a standout basketball player at Campbell. The couple has two sons, Ryan and Tyler.",
            "coaching_age": "6"
            }
	},
        
        {        
                "pk":4,
		"model":"roster.Coach",
		"fields": {
			"firstname": "Bryant",
                        "lastname": "Gaines",
                        "title": "Associate Coach",
			"story": "Former University of North Carolina pitcher and a member of four-straight College World Series teams, Bryant Gaines is in his second year on the Tar Heel coaching staff.Gaines worked for Ring Power Crane in Charlotte after graduating from the University of North Carolina in 2011 with a degree in sport administration. The Weddington, N.C., native replaces Robert Woodard who joined the UNC Wilmington staff as the pitching coach. During his career at Carolina, Gaines posted a 5-0 record in 35 career appearances for the Tar Heels. Gaines battled back from his second Tommy John surgery as a junior to make 10 appearances as a fifth-year senior. Gaines assists in all aspects of the program, including serving as camp director for the Carolina Baseball Camps.",
            "coaching_age": "2"
            }
	},
        
        {        
                "pk":5,
		"model":"roster.Coach",
		"fields": {
			"firstname": "Dave",
                        "lastname": "Arendas",
                        "title": "Director of Baseball Operations",
			"story": "Dave Arendas, a former All-ACC second baseman at North Carolina, is in his eighth season as director of baseball operations with the Diamond Heels. He is the program's first full-time employee in this position. Arendas, who has been a key member of the UNC staff during its recent College World Series trips, handles a variety of administrative duties, including team travel, equipment purchasing, game day organization, special events coordination and community outreach. He is also heavily involved with Carolina's Old Leaguers and played a key role with the Boshamer Stadium renovation project. Arendas, who graduated from UNC in 1990 with a Bachelor of Science degree in economics, was a four-year letterwinner from 1987-90. He helped lead the Tar Heels to the 1989 College World Series and the 1990 ACC title. Arendas was a second-team All-ACC choice in 1990 and ranks among the top 10 on Carolina's career lists for at-bats, runs, stolen bases and walks. Arendas married the former Nicole Holbrook in 1991, and the couple has three children - a son, D.C., and two daughters, Walker and Carley. The family resides in Greensboro. ",
            "coaching_age": "8"
            }
	}
        
]