[
    {
	"pk": 1,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Michael",
	    "lastname":"Massardo",
	    "dominant_hand":"L/R",
	    "number":"1",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"OF",
	    "height":"5-7",
	    "weight":"170",
	    "year":"Sophomore",
	    "hometown":"Waxhaw, N.C.",
	    "home_long":"-80.7434019",
	    "home_lat":"34.9245935",
	    "high_school":"Charlotte Latin",
	    "batting_avg": ".000",
	    "gp_gs": "4-1",
	    "at_bats": "4",
	    "runs": "1",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "2",
	    "strikeouts": "2",
	    "on_base_percentage": ".333",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"2013 Appeared in 18 games off the bench as a freshman. Hit .222 and scored four runs. Got his first career hit against Stony Brook (2/23). Also scored his first collegiate run later in the Stony Brook series (2/24). Had a pinch-hit single against Miami (3/16). Summer 2013: Spent the summer with the Baltimore Redbirds of the Cal Ripken League and hit .209 in 41 games with two doubles, six RBIs and 10 stolen bases.",
	    "story_highschool":"Charlotte Latin High School Ranked among the top 500 players in the country by Perfect Game and No. 35 in the state of North Carolina. Tabbed No. 26 in the state by Impact Baseball. Very accomplished in the classroom. Coached by Kim Cousar at Charlotte Latin School in Charlotte, N.C.. Four-year letterman at shortstop and second base. Also played football for Charlotte Latin from freshman through junior year as a wide receiver and running back. Named to the Headmaster's List all four years.",
	    "story_personal":"Michael Hunter Massardo is the son of Mike and Lisa Massardo. Born in Woodcliff Lake, N.J.. Birthday is Nov. 25. Plays guitar."
	}
    },
    
    
    {
	"pk": 2,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Adam",
	    "lastname":"Pate",
	    "dominant_hand":"R/R",
	    "number":"2",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"OF",
	    "height":"5-9",
	    "weight":"165",
	    "year":"Freshman",
	    "hometown":"Pikeville, N.C.",
	    "home_long":"-77.9819312",
	    "home_lat":"35.497105",
	    "high_school":"C.B. Aycock",
	    "batting_avg": ".143",
	    "gp_gs": "7-1",
	    "at_bats": "7",
	    "runs": "0",
	    "hits": "1",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "1",
	    "total_bases": "1",
	    "slugging": ".143",
	    "walks": "1",
	    "strikeouts": "1",
	    "on_base_percentage": ".250",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"",
	    "story_highschool":"Extremely athletic, plus runner. Tools allow him to play all over the field. Ranked among the Top 500 players in the country by Perfect Game. Tabbed the No. 24 player in the state of North Carolina by Perfect Game. Earned PG Underclass High Honorable Mention in 2012. 2013 all-state selection and two-time all-conference pick. Conference player of the year as a senior . Honor Roll student. Member of the National Honor Society. Student Body President. Coached by Charles Davis at Aycock High School.",
	    "story_personal":"Adam Marshall Pate is the son of Chad and Tracey Pate. Birthday is Nov. 1. Has not declared a major at Carolina."
	}
    },
    
    {
	"pk": 3,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Brandon",
	    "lastname":"Whiteford",
	    "dominant_hand":"L/R",
	    "number":"3",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"OF/2B",
	    "height":"5-9",
	    "weight":"171",
	    "year":"Freshman",
	    "hometown":"Douglasville, Ga.",
	    "home_long":"-84.7477136",
	    "home_lat":"33.7514966",
	    "high_school":"Chapel Hill",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"",
	    "story_highschool":"Gritty left-handed hitter with versatility on the infield. Ranked among the top 500 players in the country by Perfect Game. Tabbed the No. 64 player in the state of Georgia by Perfect Game. Earned PG Underclass High Honorable Mention in 2012. Coached by Mick Harper at Chapel Hill High School.",
	    "story_personal":"Brandon John Whiteford is the son of Dave and Debbie Whiteford. Father played college baseball. Birthday is Sept. 22. Has not declared a major at Carolina."
	}
    },
    
    {
	"pk": 4,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Wood",
	    "lastname":"Myers",
	    "dominant_hand":"L/R",
	    "number":"4",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"2B/SS",
	    "height":"5-9",
	    "weight":"171",
	    "year":"Freshman",
	    "hometown":"Chapel Hill, N.C.",
	    "home_long":"-79.0558445",
	    "home_lat":"35.9131996",
	    "high_school":"Jordan",
	    "batting_avg": ".308",
	    "gp_gs": "7-7",
	    "at_bats": "26",
	    "runs": "5",
	    "hits": "8",
	    "doubles": "1",
	    "homeruns": "0",
	    "rbi": "1",
	    "total_bases": "9",
	    "slugging": ".346",
	    "walks": "0",
	    "strikeouts": "1",
	    "on_base_percentage": ".379",
	    "assists": "12",
	    "errors": "3",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"",
	    "story_highschool":"Ranked the No. 8 player in the state of North Carolina by Perfect Game and earned all-state honors in 2012 and 2013 in addition to being named the 2012 Pac 6 Player of the Year. Ranked No. 369 in the country according to Perfect Game and has been an all-region selection by Rawlings the last two years. Atlantic Region All-America team. Honor roll member. Coached by former Tar Heel Devy Bell at Jordan High School.",
	    "story_personal":"John Woodley Myers is the son of Steve and Beth Myers. Birthday is Oct. 11. Plans to major in exercise and sport science at Carolina."
	}
    },
    
    
    {
	"pk": 5,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Michael",
	    "lastname":"Russell",
	    "dominant_hand":"R/R",
	    "number":"5",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"SS",
	    "height":"6-2",
	    "weight":"200",
	    "year":"Junior",
	    "hometown":"Huntersville, N.C.",
	    "home_long":"-80.8428504",
	    "home_lat":"35.410694",
	    "high_school":"Hopewell",
	    "batting_avg": ".250",
	    "gp_gs": "7-7",
	    "at_bats": "20",
	    "runs": "7",
	    "hits": "5",
	    "doubles": "1",
	    "homeruns": "1",
	    "rbi": "6",
	    "total_bases": "9",
	    "slugging": ".450",
	    "walks": "8",
	    "strikeouts": "2",
	    "on_base_percentage": ".0483",
	    "assists": "20",
	    "errors": "1",
	    "story_junior":"",
	    "story_sophomore":"2013: Started 70 games primarily at shortstop, missing just one game all season. Hit .298 (79-265) with 39 RBIs and 56 runs scored. Racked up 10 doubles and three triples. Second on the team in stolen bases with 18 and first on the team in stolen base percentage, stealing successfully 90% of the time. Tallied 136 assists on the season, second most on the team. Tied for fewest strikeouts among regulars with just 22 on the year. Had 22 multi-hit games on year, including a 4-for-4 performance against Virginia (5-17). Drove in three runs against NC State in the College World Series, including a two-run single that broke the game open late (6-20). Made the NCAA Chapel Hill All-Regional Team after going 6 for 14 with five RBIs in six runs over four games (5-31-6-3). Drove in a career-high five runs against The Citadel (5-1). Went 6 for 11 with three doubles and three RBIs in the Miami series (3/15-17). Made the Astros Foundation College Classic All-Tournament Team after driving in four runs in three games (3/1-3). Summer 2013: Appeared in 26 games with the Chatham Anglers of the Cape Cod League. Hit .216 with 12 runs, two doubles, a home run and 11 RBIs. Tied for the team lead in stolen bases with 11.",
	    "story_freshman":"2012: Appeared in 62 games with 62 starts, 32 in the outfield, 10 at third base and 20 at shortstop. Posted a .269 average (60-223), the fifth highest among consistent starters. Scored 40 runs and drove in 24 runs. Tallied 14 doubles and one triple. Stole 14 bases in 17 attempts, tying him at second on the team. Drew the third highest number of walks on the team with 36. Notched a hit and RBI in his collegiate debut against Xavier (2/17). Tallied two hits, both of which were doubles, and two RBIs in back-to-back games against Xavier (2/18) and Wright State (2/24). Drew two walks on five different occasions over the season. Notched a season-high four hits against Virginia (4/13). Scored three runs against Wright State (2/24). Drove in three runs off two hits while scoring a run against Wake Forest (3/31). Stole two bases and tallied one hit and one RBI against Princeton (3/20).",
	    "story_highschool":"Coached by Chuck Greeson and David Brown at Hopewell High School. Ranked the No. 16 player in North Carolina by Impact Baseball. Rated a top-1000 prospect by Perfect Game. Earned all-conference honors as a sophomore. Missed his junior season due to injury.",
	    "story_personal":"Michael Joseph Russell is the son of John and Suzanne Russell. Born in Roswell, Ga.. Birthday is January 30. Father is a member of the Massachusetts High School Basketball Hall of Fame. Majoring in management and society at Carolina."
	}
    },
    
    {
	"pk": 6,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Alex",
	    "lastname":"Rayburn",
	    "dominant_hand":"R/R",
	    "number":"6",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"INF/OF",
	    "height":"5-10",
	    "weight":"180",
	    "year":"Sophomore",
	    "hometown":"Durham, N.C.",
	    "home_long":"-78.898619",
	    "home_lat":"35.9940329",
	    "high_school":"Jordan",
	    "batting_avg": ".333",
	    "gp_gs": "3-0",
	    "at_bats": "3",
	    "runs": "0",
	    "hits": "1",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "1",
	    "total_bases": "1",
	    "slugging": ".333",
	    "walks": "1",
	    "strikeouts": "0",
	    "on_base_percentage": ".500",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"2013: Appeared in 34 games with seven starts in the outfield. Hit .188 on the year with five RBIs and eight runs scored. Tallied two doubles and did not commit an error. Recorded his first career hit against Stony Brook (2/24). Scored his first collegiate run and registered his first career RBI against Texas A&M (3/3). Went 2 for 2 with two RBIs and two runs scored against Princeton (3/19). Summer 2013: Appeared in 27 games for the High Point-Thomasville Hi-Toms of the Coastal Plain League. Hit .160, had seven RBIs and scored 13 runs with one double.",
	    "story_highschool":"Ranked No. 414 in the nation by Perfect Game and No. 14 in the state of North Carolina. Rated No. 16 in the state by Impact Baseball. Coached by former Tar Heel Devy Bell (1984-87) at Jordan High School in Durham, N.C.. Named All-Conference four times and All-State twice. Team MVP sophomore and senior seasons. Conference Player of the Year as junior. 16U WWBA National Champions with Canes baseball. Tournament of Stars participant. Also played football and basketball.",
	    "story_personal":"Alexander Joseph Raburn is the son of Doug and Kay Raburn. Born in Durham, N.C.. Birthday is May 28. Father played football at Hastings College in Nebraska."
	}
    },
    
    {
	"pk": 7,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Parks",
	    "lastname":"Jordan",
	    "dominant_hand":"L/R",
	    "number":"8",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"OF/1B",
	    "height":"6-1",
	    "weight":"190",
	    "year":"Senior",
	    "hometown":"Winston-Salem, N.C.",
	    "home_long":"-80.2529750912614",
	    "home_lat":"36.107356",
	    "high_school":"Glenn",
	    "batting_avg": ".167",
	    "gp_gs": "7-7",
	    "at_bats": "24",
	    "runs": "3",
	    "hits": "4",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "3",
	    "total_bases": "4",
	    "slugging": ".167",
	    "walks": "4",
	    "strikeouts": "1",
	    "on_base_percentage": ".276",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"2013: Appeared in 62 games and started 38 at designated hitter and in the outfield. Finished the year hitting .252 (40-159), scoring 25 runs and tallying 27 RBIs. Posted a perfect fielding percentage in 73 chances, his third consecutive season without an error. Went 1 for 2 with a pair of runs scored in the CWS win over NC State (6-20). Worked an 8-pitch walk to score the winning run in the Super Regional-clinching win over South Carolina (6-11). Had a pair of hits in the regional win over FAU (6-3). Went 3 for 4 with two RBIs and a run scored against Duke (4/21). Reached base five times and scored a season-high three runs while going 2 for 2 with two RBIs and three walks against Elon (4/17).",
	    "story_sophomore":"2012: Appeared in 60 games with 57 starts, 51 in the outfield and six at first base. Hit .270 (51-189) on the year with 29 runs scored and 31 RBI. Tallied seven doubles and four triples. Notched a career-high seven game hit streak from May 4-13. Finished fourth on the team with seven stolen bases in 11 attempts. Registered two hits or more in 12 games. Posted a perfect fielding percentage. Registered three hits, two RBI and two runs in his first start of the season against Wright State (2/24). Put up another three-hit performance with three RBI and one run scored against Wake Forest (3/30). Drove in three runs from four hits, including a double and a triple, while scoring two runs against Duke (5-12). Finished on a strong NCAA performance, scoring two runs and registered two hits and one RBI against St. John's (6-3). Summer 2012: Appeared in 34 games as an outfielder for the Baltimore Redbirds in the Cal Ripken Collegiate Baseball League. Hit .219 (25-114) on the summer with 15 runs scored and 18 RBI. Tallied four doubles, one triple, two home runs and seven stolen bases.",
	    "story_freshman":"2011: Appeared in 33 games with four starts on the year. Hit .179 (5-28) with five runs and six RBI. Started the first three games of the season in left field. Tallied his first career hit against Davidson (3/2). Scored the first run of his collegiate career in the win at USC (2/19). Doubled against UNC Wilmington (3/22). Summer 2011: Played in 21 games for the Baltimore Redbirds in the Cal Ripken Collegiate Baseball League. Finished second on the team with a .333 average (25-75). Scored 14 runs and had 11 RBI with four doubles and two triples.",
	    "story_highschool":"Played for coach John Fowler at Robert B. Glenn High School. Left-handed hitter with a great swing and polished approach. Versatile infielder with great instincts. Ranked the No. 6 prospect in North Carolina by Perfect Game and No. 21 in the state by Impact Baseball. Rated No. 237 nationally. Two-time all-state pick, two-time conference player of the year and three-time all-conference honoree. Named 2009 Piedmont Triad 3A Conference Player of the Year. 2009 North Carolina State Games participant. Earned 2009 All-America honors from Perfect Game. Set school records in batting average, triples and on base percentage. Member of A-B Honor Roll.",
	    "story_personal":"Parks Weaver Jordan is the son Aaron and Teri Gray. Born in Greensboro, N.C.. Birthday is Feb. 2. Majoring in communications at Carolina."
	}
    },
    
    {
	"pk": 8,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Henry",
	    "lastname":"Sisson",
	    "dominant_hand":"L/L",
	    "number":"11",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"LHP",
	    "height":"6-2",
	    "weight":"180",
	    "year":"Sophomore",
	    "hometown":"Chevy Chase, Md.",
	    "home_long":"-77.0779162985382",
	    "home_lat":"38.99273295",
	    "high_school":"St. Alban's",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"Davidson: Appeared in 15 games and started 9 for the Wildcats. Posted a 4-3 record with a 4.40 ERA. Threw 73.2 innings allowing 36 earned runs. Struck out 52 batters while allowing 34 walks.",
	    "story_highschool":"Team MVP senior season. Posted 6-1 record with a 2.50 ERA. Notched 80 strikeouts and two saves in 51 innings. Headmaster's List. AP Scholar. National Latin Exam Gold Medalist. Also played football.",
	    "story_personal":"Henry Winslow Sisson is the son of Edward and Kevin Sisson. Born July 21, 1992, in Bethesda, Md.. Avid golfer."
	}
    },
    
    {
	"pk": 9,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Landon",
	    "lastname":"Lassiter",
	    "dominant_hand":"R/R",
	    "number":"12",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"INF",
	    "height":"6-1",
	    "weight":"180",
	    "year":"Sophomore",
	    "hometown":"High Point, N.C.",
	    "home_long":"-80.0053176",
	    "home_lat":"35.9556924",
	    "high_school":"North Davidson",
	    "batting_avg": ".136",
	    "gp_gs": "7-7",
	    "at_bats": "22",
	    "runs": "4",
	    "hits": "3",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "3",
	    "slugging": ".136",
	    "walks": "4",
	    "strikeouts": "5",
	    "on_base_percentage": ".296",
	    "assists": "10",
	    "errors": "2",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"2013: Earned consensus freshman All-America honors (Baseball America, Perfect Game, NCBWA and Louisville Slugger) after a standout first season in Chapel Hill. Appeared in 69 games with 67 starts, 57 of those at designated hitter. Hit .358 (92-257), the second highest percentage on the team, with 28 RBIs. Scored 75 runs, second-most on the team and tied for eighth in school history. Had the second most walks on the team with 53 which also tied for fifth in school history. Recorded a .447 slugging percentage and a team-high .491 on-base percentage. Tallied 14 doubles and three triples. Stole eight bases in 12 attempts. Had 29 multi-hit games on the year, including four hits on five occasions. Named to the NCAA Chapel Hill All-Regional team after going 9 for 20 with five runs in four games (5-31-6-3). Totaled a season-high three RBIs against James Madison while going 3 for 3 and scoring two runs (5-7). Made the Astros Foundation College Classic All-Tournament team after going 6 for 12 with five runs in three games (3/1-3). Went 4 for 4 with two RBIs and two runs scored against Seton Hall (2/17). Summer 2013: Played in 22 games with the Chatham Anglers of the Cape Cod League. Hit .250 with eight runs, two doubles and seven RBIs. Was walked 23 times and stole two bases.",
	    "story_highschool":"Drafted in the 16th round (513) of the 2012 MLB First-Year Player Draft by the Arizona Diamondbacks. Ranked No. 266 in the nation by Perfect Game and tabbed No. 6 in the state of North Carolina. Tabbed No. 7 in the state by Impact Baseball. Coached by Mike Meadows at North Davidson High School in Lexington, N.C.. Played varsity baseball all four years and varsity basketball freshman and sophomore year. Named CPC All-Conference sophomore, junior and senior seasons. Named All-State senior year. Participated in the East Coast Pro Showcase, N.C. vs. S.C. All-Star Game and the Tournament of Stars.",
	    "story_personal":"Landon Joseph Lassiter is the son of Cliff and Eva Lassiter. Born in Thomasville, N.C.. Birthday is June 14. Father played baseball at Pfeiffer. Brother, Garrison, signed with Carolina before being drafted and signing with the New York Yankees."
	}
    },
    
    {
	"pk": 10,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Zach",
	    "lastname":"Daly",
	    "dominant_hand":"L/L",
	    "number":"16",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"OF",
	    "height":"6-2",
	    "weight":"180",
	    "year":"Sophomore",
	    "hometown":"Gastonia, N.C.",
	    "home_long":"-81.1873005",
	    "home_lat":"35.262082",
	    "high_school":"Forest View",
	    "batting_avg": ".267",
	    "gp_gs": "7-4",
	    "at_bats": "15",
	    "runs": "2",
	    "hits": "4",
	    "doubles": "0",
	    "homeruns": "1",
	    "rbi": "3",
	    "total_bases": "7",
	    "slugging": ".467",
	    "walks": "0",
	    "strikeouts": "4",
	    "on_base_percentage": ".267",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"2013: Appeared in 12 games off the bench during his first season. Scored four runs and hit .300 as a pinch hitter and outfielder. Recorded his first career hit and scored his first career run in his first collegiate game against St. John's (2/27). Went 1 for 2 with a run scored against Clemson (5-24). Summer 2013: Played in 28 games for the Gastonia Grizzlies of the Coastal Plain League. Hit .235 while racking up 15 RBIs, 16 runs scored, five doubles, one triple and a home run.",
	    "story_highschool":"Ranked among the top 500 in the country and No. 35 in the state of North Carolina by Perfect Game. Ranked the No. 3 player in the state by Impact Baseball. High school teammate of Reilly Hovis. Four-year center fielder. Coached by Brian Horne at Forestview High School in Gastonia, N.C.. Member of the Beta Club, National Honor Society and Technical Honor Society. Also played as a forward on Forestview's soccer team in 2008 and 2009.",
	    "story_personal":"Zachary Scott Daly is the son of Cherie Daly. Born Dec. 13, 1993, in Niagara Falls, N.Y."
	}
    },
    
    {
	"pk": 11,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Chris",
	    "lastname":"McCue",
	    "dominant_hand":"R/R",
	    "number":"17",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"RHP",
	    "height":"6-0",
	    "weight":"155",
	    "year":"Junior",
	    "hometown":"Charlotte, N.C.",
	    "home_long":"-80.8431268",
	    "home_lat":"35.2270869",
	    "high_school":"Ardrey Kell",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"Talented right-hander that throws strikes. Could see time as either a starter or a swing reliever. Could also factor into the closer role.",
	    "story_freshman":"2012: Appeared in 25 games as a reliever, posting a 2.10 ERA. Registered a 1-0 mark on the season. Threw 25.2 innings, allowing six earned runs. Struck out 17, while walking just nine. Gave up just one hit and no runs in his collegiate debut against Southern California (3/2). Threw a scoreless and hitless 2.2 frames while striking out three to earn his first win against Princeton (3/20). Struck out a career-high three batters three times on the season. Gave up zero hits in nine appearances. Ended his debut season on a seven-game streak of not giving up an earned run from May 2 through June 3. Summer 2012: Made six appearances and five starts for the Thomasville Hi-Toms of the Coastal Plain League. Posted a 2.25 ERA and registered a 3-1 mark. Threw 32 innings, allowing eight earned runs. Struck out 31. Played in the all star game. Named Baseball America's fourth-best prospect in the Coastal Plain League. ",
	    "story_highschool":"Coached by Hal Bagwell at Ardrey Kell. Drafted in the 35th round (1079th) of the 2011 MLB Draft by the New York Yankees. Ranked No. 11 in the state of North Carolina and No. 135 in the nation by Perfect Game. Impact Baseball ranks him the No. 17 player in North Carolina. Listed as the No. 44 right-hander in the country by Perfect Game. Named an Under Armour Preseason All-America. Helped lead Ardrey Kell to the SW4A High School State Championship. Earned 4A All-State honors as a senior. Honor Roll. National Honor Society Member.",
	    "story_personal":"Christopher James McCue is the son of Jim and LeeAnn McCue. Born April 23, 1993 in West Springfield, Mass.. Majoring in business administration at Carolina."
	}
    },
    
    {
	"pk": 12,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Adrian",
	    "lastname":"Chacon",
	    "dominant_hand":"R/R",
	    "number":"18",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"C/1B",
	    "height":"6-0",
	    "weight":"197",
	    "year":"Freshman",
	    "hometown":"Tampa, Fla.",
	    "home_long":"-82.458444",
	    "home_lat":"27.9477595",
	    "high_school":"Jesuit",
	    "batting_avg": ".278",
	    "gp_gs": "7-7",
	    "at_bats": "18",
	    "runs": "2",
	    "hits": "5",
	    "doubles": "2",
	    "homeruns": "0",
	    "rbi": "3",
	    "total_bases": "7",
	    "slugging": ".389",
	    "walks": "3",
	    "strikeouts": "3",
	    "on_base_percentage": ".400",
	    "assists": "4",
	    "errors": "1",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"",
	    "story_highschool":"Talented player who brings power from the right side of the plate with arm-strength that allows him to play multiple positions, including catcher. Ranked the No. 152 player in the country by Perfect Game. Tabbed the No. 21 player in the state of Florida by Perfect Game. Ranked the No. 16 catcher in the country by Perfect Game. Named a PG Underclass First Team All-America in 2012. Helped claim the 2011 World Wood Bat Championship in Jupiter. Played with fellow signee Spencer Trayner at Jesuit High School. Coached by Richie Warren at Jesuit High School.",
	    "story_personal":"Adrian Anthony Chacon is the son of Nathan and Annette Castro. Birthday is March 8. Has not declared a major at Carolina."
	}
    },

    {
	"pk": 13,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Tom",
	    "lastname":"Zengel",
	    "dominant_hand":"L/L",
	    "number":"19",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"OF",
	    "height":"5-11",
	    "weight":"200",
	    "year":"Senior",
	    "hometown":"High Bridge, N.J.",
	    "home_long":"-74.8957231",
	    "home_lat":"40.6670454",
	    "high_school":"North Hunterdon",
	    "batting_avg": ".500",
	    "gp_gs": "3-3",
	    "at_bats": "8",
	    "runs": "3",
	    "hits": "4",
	    "doubles": "3",
	    "homeruns": "0",
	    "rbi": "4",
	    "total_bases": "7",
	    "slugging": ".875",
	    "walks": "1",
	    "strikeouts": "0",
	    "on_base_percentage": ".556",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"2013: Came off the bench to appear in 17 games as a pinch hitter and hit .357 (5 for 14). Tallied four RBIs, one run scored and a double while striking out just three times. Notched a season-high three RBIs on a three-run double against St. John's (2/27).",
	    "story_sophomore":"2012: Appeared in 42 games with 24 starts, 22 as designated hitter and two in the outfield. Posted a .286 average (26-91) with 19 runs scored and 19 RBIs. Tallied seven doubles and two triples. Drew 14 walks on the year. Stole two bases in two attempts. Drove in three runs while scoring two and registering a double and a triple against Wright State (2/24). Tallied two hits, two RBIs and a run against Maryland (3/17). Drove in two runs with a triple and a walk against Elon (4/4). Scored a run and drove in two runs from two hits against Princeton (3/20). Summer 2012: Appeared in 43 games for the Danbury Westerners of the New England League. Posted a .255 average (39-153) with 28 runs scored and 28 RBIs. Tallied eight doubles, 10 home runs and five stolen bases on the summer.",
	    "story_freshman":"2011: Played in 48 games with 33 starts in the outfield and as the designated hitter. Finished with a .204 average (23-113) with 17 runs scored and 23 RBI. Tallied four doubles, two triples and a home run. Drew 19 walks on the year. Appeared in 23 games with 13 starts during the ACC season. Picked up a hit in his first career start at Cal State Fullerton (2/19). Rode a hot streak after the first hit by picking up one in the next 10 games for a season-opening 11 game streak from Feb. 19-March 5. Connected on his first career home run and drove in a season-high four runs against Stony Brook (3/5). Drove in eight runs in the series sweep of Stony Brook. Scored three times against Davidson (3/2). Posted three RBI at Virginia Tech (3/19). Tallied two hits and drove in three vs. Winthrop (4/5). Summer 2011: Started 30 games for the Outer Banks Daredevils of the Coastal Plain League. Hit .269 (32-119) for the summer with 15 runs scored and 10 RBI. Tallied five doubles, two triples and a home run.",
	    "story_highschool":"Coached by Parker Snare at North Hunterdon High School. Above average runner. Rated New Jersey's No. 4 player and the nation's No. 240 prospect by Perfect Game. All-state, all-area and All-West Jersey selection. Owns school's single-season records for hits, home runs and extra-base hits. Represented New Jersey for the third time at the World Power Showcase at Tropicana Field. Named MVP of the Under-16 WWBA national championship. Two-time all-state honoree. Three-time first team all-area pick. Three-time first team all-county selection. Named West Jersey Player of the Year. Earned Hunterdon Democrat Player of the Year award.",
	    "story_personal":"Thomas Bitow Zengel is the son of Tom and Ellen Zengel. Majoring in management and society at Carolina."
	}
    },
    
    {
	"pk": 14,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Skye",
	    "lastname":"Bolt",
	    "dominant_hand":"S/R",
	    "number":"20",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"OF",
	    "height":"6-2",
	    "weight":"175",
	    "year":"Sophomore",
	    "hometown":"Woodstock, Ga.",
	    "home_long":"-84.5193754",
	    "home_lat":"34.1014873",
	    "high_school":"Holy Innocents",
	    "batting_avg": ".238",
	    "gp_gs": "7-7",
	    "at_bats": "21",
	    "runs": "4",
	    "hits": "5",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "2",
	    "total_bases": "5",
	    "slugging": ".238",
	    "walks": "3",
	    "strikeouts": "2",
	    "on_base_percentage": ".360",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"2013: Earned consensus freshman All-America honors (Baseball America, Perfect Game, NCBWA and Louisville Slugger) after starting 54 games in the outfield and hitting .321 (68-212), the fourth-highest average on the team, despite missing a month with a broken foot. Second-team All-ACC selection. Scored 48 runs and had 51 RBIs. Tied for second on the team with 14 doubles and was fourth in home runs with six. Slugged .491 and had a .418 on base percentage. Swiped 10 bases in 13 attempts. Notched 22 multi-hit games, including seven of his first 11 collegiate outings. Went 2 for 4 with an RBI in the win over LSU in the College World Series (6-18). Had a season high five RBIs against Maryland (4/5). Hit a go-ahead three-run home run in the eighth inning of the series-clinching victory over Miami (3/17). Homered in all three games of the Wake Forest series, the first long balls of his career (3/8-10). Went 2 for 3 with a run scored in his first collegiate start against Seton Hall (2/15) and followed that up with a 4-for-5 performance one game later. Summer 2013: Made the 24-man roster for the USA Baseball Collegiate National Team.",
	    "story_highschool":"Drafted in the 26th round (804) in the 2012 MLB Draft by the Washington Nationals. Ranked the No. 6 player in the state of Georgia by Perfect Game. Ranked No. 39 in the class of 2012 by Baseball America. Tabbed the No. 45 player in the country by Perfect Game and No. 11 among outfielders in the nation. Participated in the 2011 Perfect Game All-American Classic at Petco Park in San Diego, Calif. Coached by Dylan Deal at Holy Innocents Episcopal School in Atlanta, Ga. Named MVP of high school team. Served as assistant head of FCA group. Also played football as quarterback.",
	    "story_personal":"Skye M. Bolt is the son of Mike and Eva Bolt. Born in Woodstock, Ga.. Birthday is Jan. 15. Father played college baseball."
	}
    },
    
    {
	"pk": 15,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Matt",
	    "lastname":"Rubino",
	    "dominant_hand":"L/R",
	    "number":"24",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"C",
	    "height":"5-10",
	    "weight":"190",
	    "year":"Sophomore",
	    "hometown":"Aliquippa, Pa.",
	    "home_long":"-80.2510131448239",
	    "home_lat":"40.618174",
	    "high_school":"Florence Darlington, Hopewell",
	    "batting_avg": ".000",
	    "gp_gs": "1-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "1",
	    "strikeouts": "0",
	    "on_base_percentage": ".100",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"2013: Hit .200 while appearing in 12 games off the bench during the season. Tallied two RBIs and three runs scored. Had a pair of RBIs and a run scored against St. John's (2/27). Also singled off the bench against Texas A&M (3/3). Summer 2013: Played in 40 games for the Florence RedWolves of the Coastal Plain League. Finished the summer hitting .240, scoring 15 runs and recording 10 RBIs, five doubles and a home run.",
	    "story_highschool":"Florence Dalington Technical: Appeared in 48 games as a utility player. Posted a .340 average (54-159) with 39 runs scored and team-high 40 RBIs. Tallied a school-record 19 doubles, two triples and nine home runs. Earned first team all-region honors. Hoepwell: Coached by Joe Rubino, his uncle, at Hopewell High School in Aliquippa, Pa.. First-team All-Section senior year. First-team All-Region junior year. Also played football as running back and basketball as point guard.",
	    "story_personal":"Matthew Paul Rubino is the son of James and Melissa Rubino. Born in Morehead City, N.C.. Birthday is June 30. Father was drafted for baseball but chose to join the Marine Corps."
	}
    },
    
    {
	"pk": 16,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Joe",
	    "lastname":"Dudek",
	    "dominant_hand":"L/L",
	    "number":"25",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"1B",
	    "height":"6-1",
	    "weight":"201",
	    "year":"Freshman",
	    "hometown":"Wall Township, N.J.",
	    "home_long":"-74.0853945276656",
	    "home_lat":"40.174412",
	    "high_school":"Christian Brothers Academy",
	    "batting_avg": ".238",
	    "gp_gs": "7-7",
	    "at_bats": "21",
	    "runs": "1",
	    "hits": "5",
	    "doubles": "1",
	    "homeruns": "0",
	    "rbi": "4",
	    "total_bases": "6",
	    "slugging": ".286",
	    "walks": "1",
	    "strikeouts": "3",
	    "on_base_percentage": ".237",
	    "assists": "1",
	    "errors": "1",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"",
	    "story_highschool":"Strong left-handed hitter that can hit for power. Ranked No. 117 in the country by Perfect Game. Mentioned as one of 50 Players to Watch by Baseball America.  Tabbed the fifth-best player in the state of New Jersey by Perfect Game. Participated in the East Coast Showcase along with the Area Code Games. Ranked the sixth-best first baseman in the country by Perfect Game. Excels in the classroom. Earned First Honors every semester. Member of Spanish National Honor Society. Coached by Martin Kenney at Christian Brothers Academy.",
	    "story_personal":"Joseph Michael Dudek is the son of Joe and Beth Dudek. Birthday is Jan. 6. Has not declared a major at Carolina."
	}
    },
    
    {
	"pk": 17,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Tate",
	    "lastname":"Parrish",
	    "dominant_hand":"R/L",
	    "number":"27",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"LHP",
	    "height":"6-1",
	    "weight":"180",
	    "year":"Senior",
	    "hometown":"Smithfield, N.C.",
	    "home_long":"-78.3392929",
	    "home_lat":"35.5085717",
	    "high_school":"Smithfield-Selma",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"Lefty specialist has appeared in 77 games during his three years on campus. Continues to be a valuable asset out of the Carolina bullpen. 2013: Finished the season with a 1.35 ERA, third lowest on the team, while making 20 appearances out of the bullpen. Allowed just four hits and one earned run in 6.2 innings while striking out 10. Posted the third lowest opponent batting average on the team, allowing opposing batters to hit just .148 with only one extra-base hit. Recorded saves in back-to-back outings against Liberty (4/10) and Virginia Tech (4/14). Struck out two Hokies to seal the win in Blacksburg.",
	    "story_sophomore":"2012: Appeared in 25 games out of the bullpen, posting a 2.89 ERA. Posted a 1-0 mark on the season. Threw 9.1 innings of work, allowing three earned runs. Struck out 13, while walking just five. Earned his first career win by notching a strikeout against the only batter he faced in 0.1 innings of work against Wake Forest (5-23). Tied his career-high strikeout count with three against Gardner-Webb (3/14). Appeared in 19 straight games without giving up an earned run from Feb. 18 through May 8. Finished the season with a pair of strikeouts against St. John's in NCAA play (6-3). Summer 2012: Appeared in 12 games for the Chatham Angels of the Cape Cod League. Posted a 1-3 mark at the Cape with a 2.45 ERA in 14.2 innings of work. Struck out 18 batters over the summer.",
	    "story_freshman":"2011: Appeared in the second most games with 32 on the year out of the bullpen. Posted a 2.20 ERA in 16.1 innings pitched. Opponents hit just .164 against him on the year (9-55). Struck out 15 batters, while walking 10 for the season. Made 13 appearances during the ACC season tossing six innings. Struck out eight and walked four in ACC play. Ranked second on the team in first batters retired as he sat down 23 of the first 32 batters he faced (.719). Inherited 30 runners on the year and allowed just four to score (.133 percent) the fewest on the team. Allowed just one run over his final 16 appearances of the year. Tied for the team lead with seven holds. Made his first career appearance at Cal State Fullerton (2/19). Threw a career-long two innings at Georgia Tech (5-14) and struck out a career-high three batters. Struck out a pair in back-to-back outings against High Point (3/25) and Duke (3/26). Made a pair of appearances at the College World Series against Vanderbilt (6-18 & 6-22). Summer 2011: Made a pair of appearances for the Asheboro Copperheads in the Coastal Plain League. Posted a 1-1 record with a 3.18 ERA in 5.2 innings of work. Struck out seven and walked four.",
	    "story_highschool":"Played for coach Mike Joyner at Smithfield-Selma High School. Versatile performer was rated North Carolina's No. 11 prospect by Impact Baseball and ranks No. 17 according to Perfect Game. Ranked No. 413 nationally by Perfect Game. Two-time all-state selection and a four-time all-conference honoree. Named conference's most valuable pitcher as a junior. North Carolina State Games participant. Also played basketball. Named to the Honor Roll.",
	    "story_personal":" Personal Christian Tate Parrish is the son of Frank and Kim Parrish. Born in Smithfield, N.C.. Birthday is May 30. Majoring in exercise and sport science at Carolina."
	}
    },
    
    {
	"pk": 18,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Reilly",
	    "lastname":"Hovis",
	    "dominant_hand":"R/R",
	    "number":"28",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"RHP",
	    "height":"6-3",
	    "weight":"190",
	    "year":"Sophomore",
	    "hometown":"Gastonia, N.C.",
	    "home_long":"-81.1873005",
	    "home_lat":"35.262082",
	    "high_school":"Forestview",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"Appeared in 18 games with four starts. Finished 4-0 on the year with a 2.36 ERA in 34.1 innings pitched, allowing just nine earned runs and 20 hits. Struck out 26 batters while holding opponents to just a .164 batting average. Got the win in two of Carolina's most dramatic wins of the year. Retired the last batter in UNC's 13-inning win over Florida Atlantic in the NCAA Chapel Hill Regional. Went five scoreless innings in relief to get the win over Clemson in the ACC Championship. Gave up just one hit and no runs in five innings against Appalachian State (5/14). Struck out a season-high five batters while conceding just one earned run against Charlotte (4/24). Pitched a season-high five innings three times during the season.",
	    "story_highschool":"Ranked No. 276 in the nation by Perfect Game and No. 7 in the state of North Carolina. Earned the No. 8 ranking in the state by Impact Baseball. High School teammate of fellow freshman Zach Daly. Coached by Brian Horne at Forestview High School in Gastonia, N.C.. Also played soccer sophomore year. Member of National Honor Society and Beta Club.",
	    "story_personal":"Patrick O'Reilly Hovis is the son of Richard and Kelly Hovis. Born Oct. 27, 1993, in Gastonia, N.C.. Mother played tennis at St. Mary's. Cousin, Jonathan Hovis, played baseball at UNC and in the minor leagues for the New York Yankees"
	}
    },
    
    {
	"pk": 19,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Tyler",
	    "lastname":"Ramirez",
	    "dominant_hand":"L/R",
	    "number":"29",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"OF",
	    "height":"5-9",
	    "weight":"197",
	    "year":"Freshman",
	    "hometown":"Suffolk, Va.",
	    "home_long":"-76.5835703",
	    "home_lat":"36.7282096",
	    "high_school":"Cape Henry Collegiate",
	    "batting_avg": ".174",
	    "gp_gs": "6-5",
	    "at_bats": "23",
	    "runs": "3",
	    "hits": "4",
	    "doubles": "1",
	    "homeruns": "0",
	    "rbi": "1",
	    "total_bases": "5",
	    "slugging": ".217",
	    "walks": "2",
	    "strikeouts": "5",
	    "on_base_percentage": ".240",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"",
	    "story_highschool":"Polished left-handed swing. Ranked among the top 1,000 players in the country by Perfect Game. Tabbed the No. 48 player in the state of North Carolina by Perfect Game. Earned PG Underclass Honorable Mention in 2012. Helped lead Cape Henry to the VISAA Division 2 State Championship as a junior. Honor Roll student. Member of National Honor Society. Coached by Tim Hummel at Cape Henry Collegiate.",
	    "story_personal":"Tyler Christopher Ramirez is the son of Ray and Vicky Ramirez. Comes from a large family with three brothers and a sister and 19 cousins, 15 of whom are boys. Birthday is Feb. 21. Plans to major in business at Carolina."
	}
    },
    
    {
	"pk": 20,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Trent",
	    "lastname":"Thornton",
	    "dominant_hand":"R/R",
	    "number":"31",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"RHP",
	    "height":"6-0",
	    "weight":"170",
	    "year":"Sophomore",
	    "hometown":"Charlotte, N.C.",
	    "home_long":"-80.8431268",
	    "home_lat":"35.2270869",
	    "high_school":"Ardrey Kell",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"2013: Earned consensus freshman All-America honors (Baseball America, Perfect Game, NCBWA and Louisville Slugger) after a standout freshman season. Appeared in 29 games, including six starts, and had a 1.37 ERA in 91.2 innings, ninth best in school history. Finished with a team-high 12 wins against just one loss. His 12 wins were a UNC freshman record and are tied for fifth-most in school history. Also recorded a team-high eight saves, spending most of the season as the top bullpen arm for the Tar Heels. Second-team All-ACC selection. Allowed just 14 earned runs and walked just 19 batters in 91.2 innings. Struck out 81 batters, third-most on the team, while keeping opponents to a .204 batting average. Allowed an earned run in just nine of 29 appearances. Tossed at least seven innings in four of his six starts, including a 7-inning, 2-run win in the College World Series against LSU. Struck out five and retired 12 batters on just 48 pitches in relief during Carolina's regional-clinching win over Florida Atlantic (6-3). Named to the NCAA Chapel Hill All-Regional team for his performance. Went 6.2 scoreless and hitless innings and struck out seven batters in relief against NC State in the ACC tournament (5-25). Carried a no-hitter into the eighth and recorded a season-high eight strikeouts against Gardner-Webb (3/12).",
	    "story_highschool":"Ranked No. 370 nationally by Perfect Game and No. 12 in the state of North Carolina. Rated No. 10 in the state by Impact Baseball. Coached by Hal Bagwell all four years at Ardrey Kell High School in Charlotte, N.C.. Team captain senior year. Also played basketball. Member of National Honor Society and National Technical Honor Society. Member of Knights in Action community service.",
	    "story_personal":"Trent Edward Thornton is the son of Jeff and Patty Thornton. Born in Pittsburgh, Pa.. Birthday is Sept. 30. Father played football at Indiana as quarterback. Grandfather, Jerry, played football and baseball at Kansas. Uncle, Wes, played football at Davidson."
	}
    },
    
    {
	"pk": 21,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Colby",
	    "lastname":"Barnette",
	    "dominant_hand":"R/R",
	    "number":"34",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"3B",
	    "height":"6-0",
	    "weight":"179",
	    "year":"Freshman",
	    "hometown":"Monroe, N.C.",
	    "home_long":"-80.5495112",
	    "home_lat":"34.9854275",
	    "high_school":"Piedmont",
	    "batting_avg": ".000",
	    "gp_gs": "1-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"",
	    "story_highschool":"Strong right-handed hitter. Athletic, versatile player. Ranked among the top 500 players in the country according to Perfect Game. Was ranked the No. 14 player in the state of North Carolina by Perfect Game. Earned PG Underclass High Honorable Mention in 2012. Two-time all-state selection. Led Piedmont to a 2A state title in 2013. Was named the RR@A Player of the Year. Finished his career ranked sixth in North Carolina history in career RBIs (127) and hits (148). AB Honor Roll Student. Voted outstanding senior by school staff. Coached by Milt Flow at Piedmont High School.",
	    "story_personal":"Colby Daniels Barnette is the son of Stephen and Kim Barnette. Birthday is Nov. 3. Has not declared a major at Carolina."
	}
    },
    
    {
	"pk": 22,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Jack",
	    "lastname":"Geraghty",
	    "dominant_hand":"R/R",
	    "number":"35",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"RHP",
	    "height":"6-1",
	    "weight":"211",
	    "year":"Freshman",
	    "hometown":"Atlanta, Ga.",
	    "home_long":"-84.3901849",
	    "home_lat":"33.7490987",
	    "high_school":"Lovett School",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"",
	    "story_highschool":"Redshirted in 2013 Lovett School Ranked among the top 500 players in the country by Perfect Game. Tabbed the No. 63 player in the state of Georgia by Perfect Game. Coached by Lance Oubs at The Lovett School in Atlanta, Ga.. Four-yea first baseman and pitcher. Also played football three seasons as defensive end, quarterback and kicker. Named to the Scholar's List all four years. Participated in YoungLife and bible study.",
	    "story_personal":"John James Geraghty III is the son of John and Beth Geraghty. Born in Richmond, Va.. Birthday is Aug. 25. Has not declared a major at Carolina."
	}
    },
    
    {
	"pk": 23,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Andrew",
	    "lastname":"Smith",
	    "dominant_hand":"R/R",
	    "number":"36",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"RHP",
	    "height":"6-2",
	    "weight":"207",
	    "year":"Senior",
	    "hometown":"Roswell, Ga.",
	    "home_long":"-84.360022",
	    "home_lat":"34.02332",
	    "high_school":"Roswell",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"Returned to the mound in the fall and could be a valuable contributor out of the bullpen after missing most of the last two seasons. 2013: Pitched a scoreless inning with two strikeouts against St. John's (2/27) before being shut down for the season.",
	    "story_sophomore":"2012: Made five relief appearances. Threw 1.1 innings, notching one strikeout. That strikeout came against Southern California (3/2). Did not give up an extra-base hit all season. Threw four hitless appearances. Underwent season-ending surgery in late April and earned a medical redshirt.",
	    "story_freshman":"2011: Made 24 appearances on the year with one start. Posted a 3-1 record with a 2.77 ERA. Threw 26 innings allowing eight earned runs while striking out 27 batters. His 2.77 ERA ranked fourth on the team among pitchers with at least 25 innings pitched. Was 1-0 in nine appearances during the ACC season. Threw a scoreless inning in his first career outing against Missouri (2/20) as he earned his first career victory. Earned the win at Virginia Tech (3/20) with a scoreless frame. Threw a career-long four innings in his first career start against Coastal Carolina (4/19). Struck out a season-high three batters three times during the season. Summer 2011: Appeared in seven games for the Falmouth Commodores in the Cape Cod League. Threw nine innings of relief, while striking out nine.",
	    "story_highschool":"Drafted in the 40th round (1,205th overall) by the Oakland Athletics. Played for coach Mike Powers at Roswell High School. Owns a polished approach on the mound with a great feel for pitching. Fastball can touch 93 mph and owns a hard breaking curve ball. Ranked as the No. 6 prospect in Georgia and No. 37 nationally by Perfect Game. Also ranked No. 79 by Baseball America. Named Earned 2009 Under Armour All-America honors and played in the Under Armour All-America Game at Wrigley Field. Claimed preseason All-America honors from both Under Armour and Perfect Game in 2009. East Coast Showcase participant. Honor roll student and a 2009 AP scholar.",
	    "story_personal":"Andrew Thomas Smith is the son of Steve and Connie Smith. Born in Roswell, Ga.. Birthday is Nov. 5. Majoring in management and society at Carolina."
	}
    },
    
    {
	"pk": 24,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Spencer",
	    "lastname":"Trayner",
	    "dominant_hand":"R/R",
	    "number":"37",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"RHP",
	    "height":"6-0",
	    "weight":"168",
	    "year":"Freshman",
	    "hometown":"Tampa, Fla.",
	    "home_long":"-82.458444",
	    "home_lat":"27.9477595",
	    "high_school":"Jesuit",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"",
	    "story_highschool":"Ultra-competitive athlete. Athleticism plays on both sides of the ball. Rare arm strength plays on the mound and in the field. Plus defender at shortstop. Ranked the No. 124 player in the country by Perfect Game. Tabbed the No. 19 player in the state of Florida by Perfect Game. Ranked the fifth-best middle infielder in the country by Perfect Game. Earned PG Underclass First Team All-America honors in 2012 after earning Third Team honors in 2011. Helped team to PG Underclassman Championship. Played with fellow signee Adrian Chacon at Jesuit High School. Coached by Richie Warren at Jesuit High School. Also played lacrosse and football at Jesuit.",
	    "story_personal":"Spencer Grant Trayner is the son of Ty and Brenda Trayner. Grandfather played for the Astros organization. Birthday is Dec. 22. Has not declared a major at Carolina."
	}
    },
    
    {
	"pk": 25,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Zac",
	    "lastname":"Gallen",
	    "dominant_hand":"R/R",
	    "number":"38",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"RHP",
	    "height":"6-0",
	    "weight":"170",
	    "year":"Freshman",
	    "hometown":"Gibbonsboro, N.J.",
	    "home_long":"-74.9648887",
	    "home_lat":"39.8381698",
	    "high_school":"Bishop Eustace",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"",
	    "story_highschool":"Polished right-handed pitcher with feel for three pitches and plus command. Ranked No. 303 in the country by Perfect Game. Tabbed the No. 10 player in the state of New Jersey by Perfect Game. Also ranked the No. 88 right-handed pitcher in the nation by Perfect Game. Earned PG Underclass Honorable Mention in 2012. Excels in the classroom. Honor Roll student. Coached by Sam Tropiano at Bishop Eustace Prep.",
	    "story_personal":"Zachary Peter Gallen is the son of Stacey and Jim Gallen. Brother played baseball in college and dad played rugby in college. Birthday is August 3. Has not declared a major at Carolina."
	}
    },
    
    {
	"pk": 26,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Benton",
	    "lastname":"Moss",
	    "dominant_hand":"R/R",
	    "number":"39",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"RHP",
	    "height":"6-2",
	    "weight":"174",
	    "year":"Junior",
	    "hometown":"Enfield, N.C.",
	    "home_long":"-77.6666415",
	    "home_lat":"36.1809865",
	    "high_school":"Rocky Mount",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"2013: Appeared in 19 games and started 16 as a sophomore. Posted a 3.77 ERA in 88.1 innings, third-most on the team. Recorded the second-most strikeouts on the team, striking out 92 batters. Walked just 34 opposing batters while compiling a 8-1 record, good for third on the team in wins. Won his first seven decisions of the year, including ACC victories against Wake Forest (3/9), Miami (3/16), Boston College (3/23) and Duke (4/20). Tossed six or more innings in six outings. Tallied a season-high nine strikeouts twice and recorded at least seven strikeouts in an outing six times. Tossed a season-high eight innings without conceding a run and giving up just two hits while striking out five against Georgia Tech (5-11). Went seven innings with nine strikeouts while allowing no runs and just two hits against Miami (3/16). Earned ACC Pitcher of the Week honors for his performance against the Hurricanes. Made to the CoSIDA Academic All-District team.",
	    "story_freshman":"2012: Louisville Slugger Freshman All-America. National Collegiate Baseball Writers Association Freshman All-America. Appeared in 17 games with 16 starts, posting a 1.94 ERA, the lowest of all starters. Registered a 7-2 mark. Threw 79 innings, allowing 17 earned runs. His 1.94 ERA was the third-lowest in the ACC. Struck out 83, the second most on the team. Opponents hit .218 against him on the season. Earned his first collegiate win with an 8.1-inning gem against Elon (3/7). Moss struck out eight and allowed just three hits in that win, which was followed by another victory in his next scoreless appearance against UNC Greensboro (3/13). Struck out a career-high 10 against Maryland (3/18). Earned three ACC wins against Virginia (4/15), Georgia Tech (4/21) and Virginia Tech (5-18). Struck out nine batters in three ACC games in a row from April 1-15.",
	    "story_highschool":"Coached by Kent Cox at Rocky Mount. Ranked No. 2 in North Carolina by Impact Baseball and No. 3 by Perfect Game. Rated No. 68 in the country by Perfect Game and No. 85 by Baseball America. Earned all-area and all-state honors. Named an Under Armour All-America. \"A\" Honor throughout high school career. Ranked in the top five in his class academically. Morehead Cain Scholar.",
	    "story_personal":"Thomas Benton Moss III is the son of Tom and Ashley Moss. Born in Tarboro, N.C.. Birthday is February 21. Plays the guitar and the piano. Majoring in economics and business administration at Carolina."
	}
    },
    
   {
	"pk": 27,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Matt",
	    "lastname":"Orth",
	    "dominant_hand":"L/L",
	    "number":"41",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"LHP",
	    "height":"6-1",
	    "weight":"190",
	    "year":"Freshman",
	    "hometown":"High Point, N.C.",
	    "home_long":"-80.0053176",
	    "home_lat":"35.9556924",
	    "high_school":"Southwest Guilford",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"",
	    "story_highschool":"Left-handed pitcher with plus command of fastball and breaking ball. Left-handed bat that projects to hit for power. Ranked among the Top 500 in the country by Perfect Game. Tabbed as the No. 26 player in the state of North Carolina by Perfect Game. Played in the East Coast Showcase. Earned PG Underclass High Honorable Mention in 2011 and 2012. Earned 4A All-State honors. Named the Piedmont Triad Player of the Year. Coached by Reid Holmes at Southwest Guilford High School.",
	    "story_personal":"Matthew Conner Orth is the son of Keith and Angie Orth. Great uncle played professional baseball. Birthday is Oct. 14. Has not declared a major at Carolina."
	}
    },
    
   {
	"pk": 28,
	"model":"roster.Player",
	"fields": {
	    "firstname":"A.J.",
	    "lastname":"Bogucki",
	    "dominant_hand":"R/R",
	    "number":"42",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"RHP",
	    "height":"6-3",
	    "weight":"191",
	    "year":"Freshman",
	    "hometown":"Gilbertsville, Pa.",
	    "home_long":"-75.6090936296278",
	    "home_lat":"40.32197655",
	    "high_school":"Boyertown Area",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"",
	    "story_highschool":"Polished right-handed pitcher that pounds the strike zone. Plus fastball andslider. Ranked No. 94 in Baseball Americas Top 100. Ranked the No. 69 player in the country by Perfect Game. Tabbed as the top player in the state of Pennsylvania. Also ranked the No. 20 right-handed pitcher in the country. Played in the prestigious Under Armour All-America Game at Wrigley Field. Also participated in the Area Code Games. Named The Mercury Player of the Year as a junior. Excels in the classroom. High Honor Roll Member. Coached by Todd Moyer at Boyertown Area High School.",
	    "story_personal":"Aaron John Bogucki is the son of Scott and Tracy Bogucki. Birthday is May 2. Plans to major in business at Carolina."
	}
    },
    
    {
	"pk": 29,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Korey",
	    "lastname":"Dunbar",
	    "dominant_hand":"R/R",
	    "number":"43",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"C",
	    "height":"6-0",
	    "weight":"215",
	    "year":"Sophomore",
	    "hometown":"Charleston, W.Va.",
	    "home_long":"-81.6326301",
	    "home_lat":"38.3498221",
	    "high_school":"Nitro",
	    "batting_avg": ".500",
	    "gp_gs": "1-0",
	    "at_bats": "2",
	    "runs": "0",
	    "hits": "1",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "2",
	    "total_bases": "1",
	    "slugging": ".500",
	    "walks": "0",
	    "strikeouts": "1",
	    "on_base_percentage": ".500",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"2013: Appeared in 39 games, starting 14 at catcher. Hit .159 with three RBIs, five runs scored and two doubles. Did not commit an error in 130 total chances. Recorded his first career hit - a double - against Stony Brook (2/24). Scored his first collegiate run and tallied his first RBI against California (3/2). Summer 2013: Appeared in 20 games for the Wilson Tobs of the Coastal Plain League. Hit .313 with 16 RBIs, 10 runs scored, six doubles and three home runs.",
	    "story_highschool":"Drafted in the 39th round (1196) of the 2012 MLB Draft by the Los Angeles Dodgers. Ranked among the top 500 in the country by Perfect Game. Tabbed the top player in the state of West Virginia by Perfect Game. Earned first team all-state honors as a junior. Coached by Steve Pritchard at Nitro High School in Nitro, W.Va.. Played catcher, pitcher and third base at Nitro. Received Promise and Brandon Sneed Scholarships. High Honors graduate. Member of Mu Alpha Theta.",
	    "story_personal":"Korey Patrick Dunbar is the son of Danny and Joyce Dunbar. Born in Charleston, W.Va.. Birthday is April 21. Sister played tennis at Wright State."
	}
    },
    
    {
	"pk": 30,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Trevor",
	    "lastname":"Kelley",
	    "dominant_hand":"R/R",
	    "number":"44",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"RHP",
	    "height":"6-2",
	    "weight":"215",
	    "year":"Junior",
	    "hometown":"Wilmington, N.C.",
	    "home_long":"-77.9447107",
	    "home_lat":"34.2257282",
	    "high_school":"Ashley",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"Dropped his arm slot late in his freshman year. Dominated in the Cal Ripken Baseball League over the summer. The top closer candidate entering the spring. 2013: Tied for most appearances on the team with 32. Compiled a 3.63 ERA in 44.2 innings pitched. Allowed just 18 earned runs and walked just 19 batters while recording 36 strikeouts. Tallied two saves and a 2-1 record. Kept opposing batters to a .209 batting average. Struck out a career-high four batters in 3.2 innings against N.C. State (4/27). Tossed a career-most four innings with one hit, no runs and two strikeouts against Virginia Tech (5/26). Summer 2013: Appeared in 13 games for the Orleans Firebirds of the Cape Cod League. Posted a 1.52 ERA in 17.2 innings. Allowed just three earned runs and 12 hits. Tallied 17 strikeouts and one save",
	    "story_freshman":"2012: Appeared in four games, posting a 16.20 ERA. Pitched 1.2 innings out of the bullpen in April and May. Gave up just one hit and no runs in his collegiate debut against Coastal Carolina (3/28). Struck out three batters on the season, with two of those coming in his final appearance against Georgia Tech (4/20). Summer 2012: Appeared in 16 games for the Baltimore Redbirds in the Cal Ripken Collegiate Baseball League. Posted a 1.80 ERA with a 2-1 record. Threw 35 innings, allowing nine earned runs. Tallied five saves over the summer. Struck out 38, while walking just 10 in 35 innings of work.",
	    "story_highschool":"Coached by Brian Stewart at Ashley High School. Ranked the No. 24 player in the state of North Carolina by Perfect Game and the No. 491 player in the nation. Participated in the 2009 and 2010 State Games representing Region 2. Named all-conference as a junior.",
	    "story_personal":"Trevor Michael Kelley is the son of Greg and Jill Kelley. Born October 20, 1992 in Barrington, R.I.. Has not declared a major at Carolina."
	}
    },
    
    {
	"pk": 31,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Zach",
	    "lastname":"Rice",
	    "dominant_hand":"L/L",
	    "number":"45",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"LHP",
	    "height":"6-2",
	    "weight":"189",
	    "year":"Freshman",
	    "hometown":"Suffolk, Va.",
	    "home_long":"-76.5835703",
	    "home_lat":"36.7282096",
	    "high_school":"Nansemond River",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"",
	    "story_highschool":"Extremely projectable left-handed pitcher with three above average pitches. Ranked the No. 458 player in the country by Perfect Game.  Tabbed the No. 14 player in Virginia.  Earned PG Underclass Honorable Mention in 2012.  Has earned Academic Honor Roll all three years.  Coached by Mark Stuffel at Nansemond River High School.",
	    "story_personal":"Zachary John Rice is the son of John and Leila Rice.  Birthday is Oct. 15.  Has not declared a major at Carolina."
	}
    },
 
    {
	"pk": 32,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Luis",
	    "lastname":"Paula",
	    "dominant_hand":"R/R",
	    "number":"46",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"RHP",
	    "height":"6-3",
	    "weight":"185",
	    "year":"Junior",
	    "hometown":"McLean, Va.",
	    "home_long":"-79.6586383",
	    "home_lat":"36.1073575",
	    "high_school":"Northeast Guilford",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"Talented right-hander emerged late in the year as a freshman. Good feel for pitching who could see time in several different situations. 2013: Appeared in nine games during the season, compiling an 8.59 ERA. Recorded six strikeouts and one save in 7.1 innings pitched. Allowed just five hits and kept opponents to a .192 batting average. Tossed two scoreless and hitless innings and tallied two strikeouts against Princeton (3/19). Picked up his first career save vs. Rice in Houston with a scoreless inning in a 2-1 win (3/1). Summer 2013: Made 15 appearances with one start for the Orleans Firebirds of the Cape Cod League. Posted a 4.93 ERA and a 2-1 record, allowing 15 earned runs and struck out 15 in 27.1 innings",
	    "story_freshman":"2012: Appeared in 13 games, making two starts and posting a 5.95 ERA. Pitched 19.2 innings while allowing 13 earned runs. Struck out 21 batters on the season. Struck out five in his first collegiate start against Davidson (3/6). Notched four strikeouts while giving up just one earned run against UNC Greensboro (4/24). Pounded the zone for seven strikeouts in 4.1 innings against St. Johns in postseason play (6-3). Summer 2012: Appeared in nine games, making seven starts for the Forest City Owls of the Coastal Plain League. Registered a 4-3 mark with a 3.15 ERA. Struck out 28 in 40 innings of work, while allowing just 14 earned runs. Named the 14th-best prospect in the league by Perfect Game.",
	    "story_highschool":"Coached by David Lawing at Northeast Guilford. Ranked No. 21 in the state by Impact Baseball. Rated a top 1000 prospect by Perfect Game. Named to the 3A All-State Team as a junior. Helped lead Northeast Guilford to the Mid-Piedmont 3A Championship. Ranked No. 7 academically in his class.",
	    "story_personal":"Juan Luis Antonio Paula is the son of Miguel and Emily Paula. Born June 22, 1993 in Greensboro, N.C.. Major in exercise and sport science at Carolina."
	}
    },
    
{
	"pk": 33,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Chris",
	    "lastname":"Oakley",
	    "dominant_hand":"R/R",
	    "number":"47",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"RHP",
	    "height":"6-6",
	    "weight":"226",
	    "year":"Freshman",
	    "hometown":"Egg Harbor, N.J.",
	    "home_long":"-74.366968",
	    "home_lat":"39.6452742",
	    "high_school":"St. Augustine Prep",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"",
	    "story_highschool":"Big frame right-handed pitcher with a plus fastball slider. Attacks hitters. The No. 32 player in the country according to Perfect Game. Ranked No. 62 in Baseball America's Top 100. Tabbed the No. 2 player in the state of New Jersey. Ranked the 10th-best right-handed pitcher in the country according to Perfect Game. Played in the Perfect Game All-America Game at Petco Park. Participated in the Area Code Games. Earned PG Underclass First Team All-America honors in 2012. Coached by Mike Bylone at St. Augustine Prep.",
	    "story_personal":"Christopher Michael Oakley is the son of Paul and Lisa Oakley. Birthday is Aug. 20. Has not declared a major at Carolina."
	}
    },
    
{
	"pk": 34,
	"model":"roster.Player",
	"fields": {
	    "firstname":"Taylore",
	    "lastname":"Cherry",
	    "dominant_hand":"R/R",
	    "number":"48",
	    "imgurl":"http://image.cdnllnwnl.xosnetwork.com/pics33/400/XC/XCACSSLIZEHHCDU.20130826190409.jpg",
	    "position":"RHP",
	    "height":"6-8",
	    "weight":"270",
	    "year":"Sophomore",
	    "hometown":"Dayton, Ohio",
	    "home_long":"-84.1916069",
	    "home_lat":"39.7589478",
	    "high_school":"Butler",
	    "batting_avg": ".000",
	    "gp_gs": "0-0",
	    "at_bats": "0",
	    "runs": "0",
	    "hits": "0",
	    "doubles": "0",
	    "homeruns": "0",
	    "rbi": "0",
	    "total_bases": "0",
	    "slugging": ".000",
	    "walks": "0",
	    "strikeouts": "0",
	    "on_base_percentage": ".000",
	    "assists": "0",
	    "errors": "0",
	    "story_junior":"",
	    "story_sophomore":"",
	    "story_freshman":"One of the most talented and projectable right-handers in the country. Possesses great stuff and has a good feel for the strike zone.",
	    "story_highschool":"Ranked the No. 21 player in the nation by Perfect Game and No. 2 in the state of Ohio. Baseball America tabbed Cherry No. 38 in the 2012 class. Played in the Perfect Game All-American Game. Was named the Gatorade Player of the Year of Ohio as a junior. Coached by Trent Dues at Vandalia-Butler High School in Vandalia, Ohio.. Also played basketball from freshman to junior year. Named to the principal's list freshman and senior years.",
	    "story_personal":"Taylore Lewis Cherry is the son of Ron and Kathy Cherry. Born June 24, 1993, in Dayton, Ohio."
	}
    }
    
]